[
  {
    "topic": "Functions",
    "subtopic": "Types of functions",
    "content": "Functions assign each input exactly one output. In calculus, several classes of functions are fundamental:\n- Linear functions have the form f(x) = mx + b and exhibit constant rate of change.\n- Quadratic functions have the form f(x) = ax^2 + bx + c and produce parabolic graphs.\n- Polynomial functions are finite sums of power terms with real coefficients, e.g., f(x) = 4x^3 - x + 2.\n- Rational functions are ratios of polynomials defined where the denominator is nonzero.\n- Exponential functions have a variable exponent with constant base, e.g., f(x) = a^x with a > 0.\n- Logarithmic functions are inverses of exponential functions, such as f(x) = log_a(x).\n- Piecewise functions use different expressions across specified intervals of the domain.",
    "example": "Example 1: f(x) = 5x - 2 is linear with constant slope 5.\nExample 2: g(x) = 2x^2 + 1 is quadratic and opens upward.\nExample 3: h(x) = (x - 3)/(x^2 - 4) is rational and undefined at x = ±2.",
    "common_mistake": "Learners sometimes treat rational or piecewise functions as being defined everywhere, overlooking excluded inputs or interval constraints.",
    "difficulty": "beginner"
  },
  {
    "topic": "Functions",
    "subtopic": "Domain and range",
    "content": "The domain of a function is the set of all permissible input values, while the range is the set of resulting output values. Domain restrictions arise from division by zero, even roots of negative numbers (in real-valued contexts), and logarithms of nonpositive values. Range often requires analyzing graph behavior, asymptotes, and monotonicity.",
    "example": "Example: f(x) = 1/(x − 2) has domain x ≠ 2 and range y ≠ 0.\nExample: g(x) = √(x + 3) has domain x ≥ −3 and range y ≥ 0.",
    "common_mistake": "Confusing domain restrictions caused by algebraic expressions (such as denominators) with restrictions coming from context or word problems.",
    "difficulty": "beginner"
  },
  {
    "topic": "Functions",
    "subtopic": "Function transformations",
    "content": "Transformations modify a parent function graph. Vertical shifts add/subtract outside the function; horizontal shifts add/subtract inside the input. Reflections flip graphs across axes. Vertical stretches/compressions multiply outside, while horizontal stretches/compressions multiply inside the input variable by reciprocal factors.",
    "example": "Example: y = (x − 3)^2 + 2 represents a right shift of 3 and upward shift of 2 from y = x^2.\nExample: y = −2f(3x) reflects across the x-axis, vertically stretches by 2, and horizontally compresses by a factor of 1/3.",
    "common_mistake": "Misinterpreting horizontal transformations by applying the same sign logic used for vertical shifts instead of reversing the sign inside the function.",
    "difficulty": "beginner"
  },
  {
    "topic": "Functions",
    "subtopic": "Quadratic equations and roots",
    "content": "Quadratic equations have the form ax^2 + bx + c = 0. Solutions may be obtained by factoring, completing the square, or using the quadratic formula x = (−b ± √(b^2 − 4ac)) / (2a). The discriminant, Δ = b^2 − 4ac, classifies roots as real and distinct, real and repeated, or complex.",
    "example": "Example: x^2 − 5x + 6 = 0 factors to (x − 2)(x − 3) = 0, roots x = 2, 3.\nExample: For x^2 + 4x + 5, Δ = 16 − 20 = −4, so roots are complex.",
    "common_mistake": "Ignoring the discriminant and assuming all quadratics have real roots, or misapplying signs when substituting into the quadratic formula.",
    "difficulty": "beginner"
  },
  {
    "topic": "Functions",
    "subtopic": "Trigonometric functions and identities",
    "content": "The six trigonometric functions (sin, cos, tan, csc, sec, cot) relate sides of right triangles and angles on the unit circle. Fundamental identities include reciprocal identities (e.g., sec x = 1/cos x), Pythagorean identities (sin^2 x + cos^2 x = 1), co-function relationships, and angle formulas such as double-angle and sum/difference identities.",
    "example": "Example: tan x = sin x / cos x.\nExample: Using sin^2 x + cos^2 x = 1 to rewrite sin^2 x = 1 − cos^2 x.",
    "common_mistake": "Substituting incorrectly into identities or assuming identities apply only for specific angles rather than all values in the domain.",
    "difficulty": "intermediate"
  },
  {
    "topic": "Limits & Continuity",
    "subtopic": "Average and instantaneous rate of change",
    "content": "Average rate of change over [a, b] equals (f(b) − f(a)) / (b − a), representing the slope of the secant line. Instantaneous rate of change is the derivative at a point and corresponds to the slope of the tangent line as the interval shrinks toward zero.",
    "example": "Example: For f(x) = x^2 on [1, 3], average rate = (9 − 1)/(3 − 1) = 4.\nInstantaneous rate at x = 2 is f'(2) = 4.",
    "common_mistake": "Treating average rate as identical to instantaneous rate or forgetting that instantaneous rate requires a limiting process.",
    "difficulty": "beginner"
  },
  {
    "topic": "Limits & Continuity",
    "subtopic": "Definition of a limit",
    "content": "The limit of f(x) as x approaches a value a describes the value that f(x) approaches, regardless of the function's actual value at a. Formally, lim(x→a) f(x) = L if f(x) can be made arbitrarily close to L by choosing x sufficiently close to a.",
    "example": "Example: For f(x) = (x^2 − 1)/(x − 1), lim(x→1) f(x) = 2 even though f(1) is undefined.",
    "common_mistake": "Assuming the limit depends on the function’s value at the point or neglecting behavior from both sides of the input.",
    "difficulty": "intermediate"
  },
  {
    "topic": "Limits & Continuity",
    "subtopic": "Limit laws",
    "content": "Limit laws allow algebraic manipulation of limits, including sum, difference, product, quotient, power, and composition rules. These laws apply when individual component limits exist and denominators are nonzero.",
    "example": "Example: lim(x→2) (3x^2 + 5x) = 3·2^2 + 5·2 = 22 using sum and product laws.",
    "common_mistake": "Applying limit laws where one-sided limits differ or when an underlying limit does not exist.",
    "difficulty": "intermediate"
  },
  {
    "topic": "Limits & Continuity",
    "subtopic": "One-sided limits and limits at infinity",
    "content": "One-sided limits analyze behavior as x approaches a value from only the left or right. Limits at infinity describe long-run behavior as x grows without bound or decreases without bound and are closely related to horizontal asymptotes.",
    "example": "Example: lim(x→0⁺) ln x = −∞.\nExample: For f(x) = 1/x, lim(x→∞) f(x) = 0.",
    "common_mistake": "Failing to distinguish between left-hand and right-hand behavior or assuming all functions have horizontal asymptotes.",
    "difficulty": "intermediate"
  },
  {
    "topic": "Limits & Continuity",
    "subtopic": "Continuity",
    "content": "A function is continuous at x = a if three conditions hold: f(a) is defined, the limit as x→a exists, and the limit equals f(a). Discontinuities may be removable, jump, or infinite, depending on how the function behaves near the point.",
    "example": "Example: A hole at x = 2 represents a removable discontinuity if redefining f(2) makes the function continuous.",
    "common_mistake": "Confusing discontinuities caused by undefined points with discontinuities caused by differing one-sided limits.",
    "difficulty": "intermediate"
  },
  {
    "topic": "Limits & Continuity",
    "subtopic": "L’Hôpital’s Rule",
    "content": "L’Hôpital’s Rule evaluates limits producing indeterminate forms 0/0 or ∞/∞ by differentiating numerator and denominator, provided differentiability assumptions are satisfied and the resulting limit exists.",
    "example": "Example: lim(x→0) (sin x)/x = lim(x→0) (cos x)/1 = 1 using L’Hôpital’s Rule.",
    "common_mistake": "Applying the rule to expressions that are not indeterminate or to forms such as 0·∞ without proper algebraic conversion.",
    "difficulty": "advanced"
  },
  {
    "topic": "Derivatives",
    "subtopic": "Basic derivatives",
    "content": "The derivative measures instantaneous rate of change. For polynomials, exponential, and logarithmic functions, derivative rules include: d/dx[x^n] = nx^{n−1}, d/dx[e^x] = e^x, and d/dx[ln x] = 1/x for x > 0.",
    "example": "Example: f(x) = 4x^3 → f'(x) = 12x^2.\nExample: g(x) = ln x → g'(x) = 1/x.",
    "common_mistake": "Dropping coefficients or exponents when applying the power rule.",
    "difficulty": "beginner"
  },
  {
    "topic": "Derivatives",
    "subtopic": "Trigonometric derivatives",
    "content": "Core trigonometric derivatives include: d/dx[sin x] = cos x, d/dx[cos x] = −sin x, d/dx[tan x] = sec^2 x, d/dx[cot x] = −csc^2 x, d/dx[sec x] = sec x tan x, and d/dx[csc x] = −csc x cot x.",
    "example": "Example: f(x) = 3sin x → f'(x) = 3cos x.",
    "common_mistake": "Forgetting negative signs in derivatives of cosine, cotangent, and cosecant.",
    "difficulty": "intermediate"
  },
  {
    "topic": "Derivatives",
    "subtopic": "Rules of differentiation",
    "content": "Differentiation rules include the product rule (uv)' = u'v + uv', quotient rule (u/v)' = (u'v − uv')/v^2, and chain rule d/dx[f(g(x))] = f'(g(x))·g'(x). These rules enable differentiation of composite and structured functions.",
    "example": "Example: f(x) = (x^2)(e^x) → f'(x) = 2x e^x + x^2 e^x.\nExample: h(x) = √(3x + 1) → h'(x) = (3)/(2√(3x + 1)).",
    "common_mistake": "Applying the power rule directly to composite functions instead of using the chain rule.",
    "difficulty": "intermediate"
  },
  {
    "topic": "Derivatives",
    "subtopic": "Implicit differentiation",
    "content": "Implicit differentiation differentiates both sides of an equation involving x and y while treating y as a function of x and applying the chain rule to dy/dx terms.",
    "example": "Example: From x^2 + y^2 = 25 → 2x + 2y(dy/dx) = 0 → dy/dx = −x/y.",
    "common_mistake": "Omitting dy/dx when differentiating terms that involve y.",
    "difficulty": "advanced"
  },
  {
    "topic": "Derivatives",
    "subtopic": "Higher-order derivatives",
    "content": "Higher-order derivatives are derivatives of derivatives. The second derivative describes concavity and acceleration, while higher orders support curvature and motion modeling.",
    "example": "Example: f(x) = x^3 → f'(x) = 3x^2, f''(x) = 6x.",
    "common_mistake": "Confusing first-order behavior (slope) with second-order behavior (concavity).",
    "difficulty": "intermediate"
  },
  {
    "topic": "Derivatives",
    "subtopic": "Applications of derivatives",
    "content": "Derivatives support linearization, related rates, and optimization. Tangent line approximations use L(x) = f(a) + f'(a)(x − a). Related rates apply implicit differentiation to time-dependent quantities. Optimization problems locate critical points and classify maxima or minima using first- or second-derivative tests.",
    "example": "Example: Maximizing area of a rectangle with fixed perimeter requires finding where derivative of area equals zero.",
    "common_mistake": "Failing to test critical points or ignoring domain constraints in optimization problems.",
    "difficulty": "advanced"
  },
  {
    "topic": "Integrals",
    "subtopic": "Antiderivatives and indefinite integrals",
    "content": "An antiderivative reverses differentiation. The indefinite integral ∫f(x) dx represents a family of functions differing by a constant C. Standard forms include power, exponential, logarithmic, and trigonometric antiderivatives.",
    "example": "Example: ∫3x^2 dx = x^3 + C.\nExample: ∫cos x dx = sin x + C.",
    "common_mistake": "Forgetting the constant of integration.",
    "difficulty": "beginner"
  },
  {
    "topic": "Integrals",
    "subtopic": "Definite integrals and the Fundamental Theorem of Calculus",
    "content": "A definite integral ∫_a^b f(x) dx represents signed area under the curve. The Fundamental Theorem of Calculus links derivatives and integrals: if F'(x) = f(x), then ∫_a^b f(x) dx = F(b) − F(a).",
    "example": "Example: For f(x) = 2x, ∫_0^3 2x dx = (x^2)|_0^3 = 9.",
    "common_mistake": "Mixing up definite and indefinite integrals or omitting evaluation at endpoints.",
    "difficulty": "intermediate"
  },
  {
    "topic": "Integrals",
    "subtopic": "Integration techniques",
    "content": "Techniques include substitution (reverse chain rule), integration by parts (∫u dv = uv − ∫v du), partial fractions for rational expressions, and trigonometric substitution for radical expressions involving quadratic forms.",
    "example": "Example: ∫x e^x dx → integration by parts with u = x, dv = e^x dx.",
    "common_mistake": "Selecting an inefficient technique or failing to simplify before applying a method.",
    "difficulty": "advanced"
  },
  {
    "topic": "Integrals",
    "subtopic": "Numerical integration",
    "content": "Numerical methods approximate definite integrals using sampled function values. Techniques include left/right Riemann sums, midpoint rule, trapezoid rule, and Simpson’s rule for higher accuracy on smooth functions.",
    "example": "Example: Trapezoid rule approximates area using average of left and right endpoint values on each subinterval.",
    "common_mistake": "Ignoring whether the approximation underestimates or overestimates depending on concavity.",
    "difficulty": "intermediate"
  },
  {
    "topic": "Integrals",
    "subtopic": "Applications of integrals",
    "content": "Integrals compute area under curves, displacement from velocity, total distance using |v(t)|, and average value of a function using (1/(b − a)) ∫_a^b f(x) dx.",
    "example": "Example: Position from velocity: s(t) = s(a) + ∫_a^t v(u) du.",
    "common_mistake": "Confusing displacement with total distance when velocity changes sign.",
    "difficulty": "intermediate"
  }
]
